package com.juliatoltaeva.com.JuliaToltaeva.kotlincourse.lesson25.homework.task7


//Задание 7. Создай функцию расширения словаря из списка и множества, которая
// принимает все известные тебе типы (вспомни все что знаешь и под каждый тип создай
// аргумент) и возвращает строку. Функция должна распечатать все данные, которые
// тебе в ней доступны и вернуть конкатенацию всех данных которые ей доступны
// (порядок неважен). Конкатенация - это присоединение. Код должен быть отформатирован
// таким образом, чтобы легко читался.
//По аналогии с предыдущим заданием выполни трансформации.
