package com.juliatoltaeva.com.JuliaToltaeva.kotlincourse.lesson31.homework.unittest

//Создай реализацию представленного ниже интерфейса с пустыми методами.
//Создай тестовый класс для твоей реализации. Для каждого метода напиши набор юнит тестов,
// которые будут покрывать те требования к методу, что перечислены в документации к методу интерфейса.
// После написания тестов к методу напиши его реализацию и выполни тесты. Если тесты найдут ошибку - исправь.
// В этом упражнении старайся придерживаться подхода Test Driven Development - сначала тесты, потом реализация.
//Обратите внимание при сравнении двух дробных float значений:
// рассчётное значение может быть 1.10038 вместо 1.1 - это особенность расчёта значений с плавающей точкой.
// Чтобы такие значения сравнить нужно использовать проверку на равенство с дельтой, которая передаётся третьим
// аргументом в assertEquals, достаточно значения 0.01








