package com.juliatoltaeva.com.JuliaToltaeva.kotlincourse.lesson5

fun main () {

    printVolume(10.0)

}

// Оператор элвиса
//
// Задание выполняется в виде функций, принимающих один или более аргументов.
// Все функции должны быть вызваны из функции main() в вариантах с null и с вещественным значением.

//======
// Контекст: Вы изучаете физическое явление затухания звука в помещении.
// У вас есть измеренное значение начальной интенсивности звука,
// но из-за ограничений оборудования данные о коэффициенте затухания иногда могут быть неизвестны.
// Задача: Рассчитать предполагаемую интенсивность звука после затухания.
// Интенсивность звука после затухания пропорциональна начальной интенсивности, умноженной на коэффициент затухания.
// Если коэффициент затухания неизвестен, использовать стандартное значение 0.5.

fun printVolume (volumeCurrent: Double?) {
    val volumeBasic = 10.0
    println(volumeCurrent ?: volumeBasic)
}


// ======
// Контекст: Клиент оплачивает доставку груза. К стоимости доставки добавляется страховка на груз,
// которая составляет 0,5% от его стоимости. В случае, если стоимость не указана, то берётся стандартная стоимость в $50
// Задача: Рассчитать полную стоимость доставки.

// =====
// Контекст: Вы проводите метеорологические измерения.
// Одним из важных показателей является атмосферное давление, которое должно быть зафиксировано.
// Лаборант приносит вам набор показателей, но по пути может что-нибудь потерять.
// Задача - сообщить об ошибке в случае отсутствия показаний атмосферного давления.
