package com.juliatoltaeva.com.JuliaToltaeva.kotlincourse.lesson22.homework

//Задача 1: Тренируемся составлять сигнатуру функции расширяющей класс.
// Можешь проявить свою творческую жилку и в коде функции что-нибудь сделать
// с входящими данными, чтобы вернуть итоговый результат или распечатать его,
// если нет возвращаемого типа.

//Определите функцию-расширение для массива чисел, которая не принимает
// аргументов и возвращает пару из чисел.

fun Array<Int>.useArray(): Pair<Int, Int> {

    return 2024 to 34

}