package com.juliatoltaeva.com.JuliaToltaeva.kotlincourse.lesson7

fun main() {

//Задания для Цикла for
//Прямой Диапазон:

//Напишите цикл for, который выводит числа от 1 до 5.
    println("for")
    for (i in 1..5) {
        print("$i ")
    }

//Напишите цикл for, который выводит четные числа от 1 до 10.
    println("")
    for (i in 1..10) {
        if (i%2 == 0) {
            print("$i ")
        }
    }

//Обратный Диапазон:
//Создайте цикл for, который выводит числа от 5 до 1.
    println("")
    for (i in 5 downTo 1) {
        print("$i ")
    }

//Создайте цикл for, который выводит числа от 10 до 1, уменьшая их на 2.
    println("")
    for (i in 10 downTo 1 step 2) {
        print("$i ")
    }

//С Шагом (step):
//Используйте цикл for с шагом 2 для вывода чисел от 1 до 9.
    println("")
    println("step")
    for (i in 1..9 step 2) {
        print("$i ")
    }

//Напишите цикл for, который выводит каждое третье число в диапазоне от 1 до 20.
    println("")
    for (i in 1..20 step 3) {
        print("$i ")
    }

//Использование До (until):
//Используйте цикл for и until, чтобы вывести числа из диапазона 1-9 (9 не включается).
    println("")
    println("until")
    for (i in 1 until 9){
        print("$i ")
    }

//Напишите цикл for с until, чтобы вывести числа от 3 до 15, не включая 15.
    println("")
    for (i in 3 until 15) {
        print("$i ")
    }

//Задания для Цикла while
//Цикл while:
//Создайте цикл while, который выводит квадраты чисел от 1 до 5.
    println("")
    println("while")
    var counter = 1
    while (counter++ < 5) {
        var multiplier = counter*counter
        print("$multiplier ")
    }

//Напишите цикл while, который уменьшает число от 10 до 5. После этого вывести результат в консоль
    println("")
    var counter1 = 10
    while (counter1 >= 5) {
        print("$counter1 ")
        counter1--
    }

//Цикл do...while:
//Используйте цикл do...while, чтобы вывести числа от 5 до 1.
    println("")
    println("do...while")
    var counter2 = 5
    do{

    } while

//Создайте цикл do...while, который повторяется, пока счетчик меньше 10, начиная с 5.
    println("")

//Задания для Прерывания и Пропуска Итерации
//Использование break:
//Напишите цикл for от 1 до 10 и используйте break, чтобы выйти из цикла при достижении 6.


//Создайте цикл while, который бесконечно выводит числа, начиная с 1, но прерывается при достижении 10.


//Использование continue:
//В цикле for от 1 до 10 используйте continue, чтобы пропустить четные числа.


//Напишите цикл while, который выводит числа от 1 до 10, но пропускает числа, кратные 3.


//Задача на вложенный цикл
//Создать цикл в цикле, в каждом использовать диапазон от 1 до 10.
//В консоль вывести результат умножения переменных цикла.
//Результат умножения выводить через print() и добавлять ещё один print(“ ”) с пробелом, чтобы отделять значения в строку.
//После вложенного цикла выводить пустой println() чтобы следующий проход начинать с новой строки.
//Результат должен быть как на картинке.

}